In [2]:
import numpy as np
import pandas as pd

In [3]:
pd.date_range('1/1/2000', periods=5) # periods is day frequenct

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05'],
              dtype='datetime64[ns]', freq='D')

In [4]:
pd.date_range('1/1/2000', periods=5, freq='M')

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-30',
               '2000-05-31'],
              dtype='datetime64[ns]', freq='M')

In [5]:
pd.date_range('1/1/2000', periods=5, freq='M')[0]

Timestamp('2000-01-31 00:00:00')

In [9]:
index = pd.date_range('1/1/2000', periods=8, freq='D')
index

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [7]:
s = pd.Series(
    np.random.randn(5),
    index=list('abcde')
)
s

a    0.151447
b   -0.062432
c    0.817339
d   -0.039985
e    0.811585
dtype: float64

In [10]:
df = pd.DataFrame(
    np.random.randn(8, 3),
    index=index,
    columns=list('ABC')
)
df

                   A         B         C
2000-01-01 -1.106194 -1.110173 -2.079304
2000-01-02  0.450115  0.239930  0.763129
2000-01-03  0.613700 -0.226974 -0.466956
2000-01-04  0.309631 -0.467390 -0.876184
2000-01-05  1.383765  0.767526 -0.494084
2000-01-06 -1.926546 -0.513146  2.493088
2000-01-07  0.358822  0.986121  0.858388
2000-01-08 -2.214375  0.145683  0.159049

In [11]:
df.head()

                   A         B         C
2000-01-01 -1.106194 -1.110173 -2.079304
2000-01-02  0.450115  0.239930  0.763129
2000-01-03  0.613700 -0.226974 -0.466956
2000-01-04  0.309631 -0.467390 -0.876184
2000-01-05  1.383765  0.767526 -0.494084

In [12]:
df.tail()

                   A         B         C
2000-01-04  0.309631 -0.467390 -0.876184
2000-01-05  1.383765  0.767526 -0.494084
2000-01-06 -1.926546 -0.513146  2.493088
2000-01-07  0.358822  0.986121  0.858388
2000-01-08 -2.214375  0.145683  0.159049

In [13]:
df.head(1)

                   A         B         C
2000-01-01 -1.106194 -1.110173 -2.079304

In [17]:
df.loc['2000-01-04']

A    0.309631
B   -0.467390
C   -0.876184
Name: 2000-01-04 00:00:00, dtype: float64

In [18]:
df.iloc[0]

A   -1.106194
B   -1.110173
C   -2.079304
Name: 2000-01-01 00:00:00, dtype: float64

In [20]:
row = df.iloc[0]
column = df['A']

In [21]:
df - row

                   A         B         C
2000-01-01  0.000000  0.000000  0.000000
2000-01-02  1.556309  1.350103  2.842433
2000-01-03  1.719894  0.883199  1.612349
2000-01-04  1.415825  0.642783  1.203120
2000-01-05  2.489960  1.877699  1.585220
2000-01-06 -0.820352  0.597027  4.572392
2000-01-07  1.465016  2.096294  2.937692
2000-01-08 -1.108181  1.255856  2.238354

In [22]:
df - column

,2000-01-01 00:00:00,2000-01-02 00:00:00,2000-01-03 00:00:00,2000-01-04 00:00:00,2000-01-05 00:00:00,2000-01-06 00:00:00,2000-01-07 00:00:00,2000-01-08 00:00:00,A,B,C
2000-01-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-02,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-03,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-04,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-06,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-07,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-08,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [23]:
df.sub(row)

                   A         B         C
2000-01-01  0.000000  0.000000  0.000000
2000-01-02  1.556309  1.350103  2.842433
2000-01-03  1.719894  0.883199  1.612349
2000-01-04  1.415825  0.642783  1.203120
2000-01-05  2.489960  1.877699  1.585220
2000-01-06 -0.820352  0.597027  4.572392
2000-01-07  1.465016  2.096294  2.937692
2000-01-08 -1.108181  1.255856  2.238354

In [24]:
df.sub(column)

,2000-01-01 00:00:00,2000-01-02 00:00:00,2000-01-03 00:00:00,2000-01-04 00:00:00,2000-01-05 00:00:00,2000-01-06 00:00:00,2000-01-07 00:00:00,2000-01-08 00:00:00,A,B,C
2000-01-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-02,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-03,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-04,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-06,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-07,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2000-01-08,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [26]:
df.sub(column, axis=0)

              A         B         C
2000-01-01  0.0 -0.003979 -0.973110
2000-01-02  0.0 -0.210185  0.313014
2000-01-03  0.0 -0.840674 -1.080656
2000-01-04  0.0 -0.777021 -1.185815
2000-01-05  0.0 -0.616240 -1.877850
2000-01-06  0.0  1.413399  4.419634
2000-01-07  0.0  0.627299  0.499566
2000-01-08  0.0  2.360058  2.373424

In [27]:
# df.sub is minus or subtract

In [28]:
df. mul
df.add
df.div
''

''

In [29]:
# Axis
# 0 -> 'rows' and 'index'
# 1 -> 'columns'

In [30]:
df.sub(row, axis='rows')

                      A   B   C
2000-01-01 00:00:00 NaN NaN NaN
2000-01-02 00:00:00 NaN NaN NaN
2000-01-03 00:00:00 NaN NaN NaN
2000-01-04 00:00:00 NaN NaN NaN
2000-01-05 00:00:00 NaN NaN NaN
2000-01-06 00:00:00 NaN NaN NaN
2000-01-07 00:00:00 NaN NaN NaN
2000-01-08 00:00:00 NaN NaN NaN
A                   NaN NaN NaN
B                   NaN NaN NaN
C                   NaN NaN NaN

In [31]:
df.copy()

                   A         B         C
2000-01-01 -1.106194 -1.110173 -2.079304
2000-01-02  0.450115  0.239930  0.763129
2000-01-03  0.613700 -0.226974 -0.466956
2000-01-04  0.309631 -0.467390 -0.876184
2000-01-05  1.383765  0.767526 -0.494084
2000-01-06 -1.926546 -0.513146  2.493088
2000-01-07  0.358822  0.986121  0.858388
2000-01-08 -2.214375  0.145683  0.159049

In [32]:
df + df

                   A         B         C
2000-01-01 -2.212388 -2.220346 -4.158609
2000-01-02  0.900230  0.479860  1.526258
2000-01-03  1.227400 -0.453948 -0.933911
2000-01-04  0.619262 -0.934780 -1.752368
2000-01-05  2.767531  1.535051 -0.988169
2000-01-06 -3.853091 -1.026292  4.986176
2000-01-07  0.717643  1.972241  1.716776
2000-01-08 -4.428750  0.291366  0.318099

In [35]:
df.add(df, fill_value=0) # 0 istead of NaN

                   A         B         C
2000-01-01 -2.212388 -2.220346 -4.158609
2000-01-02  0.900230  0.479860  1.526258
2000-01-03  1.227400 -0.453948 -0.933911
2000-01-04  0.619262 -0.934780 -1.752368
2000-01-05  2.767531  1.535051 -0.988169
2000-01-06 -3.853091 -1.026292  4.986176
2000-01-07  0.717643  1.972241  1.716776
2000-01-08 -4.428750  0.291366  0.318099

In [36]:
df.loc['A', 'B'] = 1.2

In [37]:
df

                            A         B         C
2000-01-01 00:00:00 -1.106194 -1.110173 -2.079304
2000-01-02 00:00:00  0.450115  0.239930  0.763129
2000-01-03 00:00:00  0.613700 -0.226974 -0.466956
2000-01-04 00:00:00  0.309631 -0.467390 -0.876184
2000-01-05 00:00:00  1.383765  0.767526 -0.494084
2000-01-06 00:00:00 -1.926546 -0.513146  2.493088
2000-01-07 00:00:00  0.358822  0.986121  0.858388
2000-01-08 00:00:00 -2.214375  0.145683  0.159049
A                         NaN  1.200000       NaN

In [38]:
df.at['A', 'B'] = 45

In [39]:
df

                            A          B         C
2000-01-01 00:00:00 -1.106194  -1.110173 -2.079304
2000-01-02 00:00:00  0.450115   0.239930  0.763129
2000-01-03 00:00:00  0.613700  -0.226974 -0.466956
2000-01-04 00:00:00  0.309631  -0.467390 -0.876184
2000-01-05 00:00:00  1.383765   0.767526 -0.494084
2000-01-06 00:00:00 -1.926546  -0.513146  2.493088
2000-01-07 00:00:00  0.358822   0.986121  0.858388
2000-01-08 00:00:00 -2.214375   0.145683  0.159049
A                         NaN  45.000000       NaN

In [41]:
# fill_value is like when you are doing some operations on like two DataFrames it says if one of them was NaN i will assign it (only on of them) to like a number like 0

In [42]:
df.fillna(0)

                            A          B         C
2000-01-01 00:00:00 -1.106194  -1.110173 -2.079304
2000-01-02 00:00:00  0.450115   0.239930  0.763129
2000-01-03 00:00:00  0.613700  -0.226974 -0.466956
2000-01-04 00:00:00  0.309631  -0.467390 -0.876184
2000-01-05 00:00:00  1.383765   0.767526 -0.494084
2000-01-06 00:00:00 -1.926546  -0.513146  2.493088
2000-01-07 00:00:00  0.358822   0.986121  0.858388
2000-01-08 00:00:00 -2.214375   0.145683  0.159049
A                    0.000000  45.000000  0.000000

In [43]:
df.mean()

A   -0.266385
B    4.980175
C    0.044641
dtype: float64

In [44]:
df > 0

                         A      B      C
2000-01-01 00:00:00  False  False  False
2000-01-02 00:00:00   True   True   True
2000-01-03 00:00:00   True  False  False
2000-01-04 00:00:00   True  False  False
2000-01-05 00:00:00   True   True  False
2000-01-06 00:00:00  False  False   True
2000-01-07 00:00:00   True   True   True
2000-01-08 00:00:00  False   True   True
A                    False   True  False

In [45]:
(df > 0).all()

A    False
B    False
C    False
dtype: bool

In [46]:
# .any
# .empty

In [47]:
(df < 0).all()

A    False
B    False
C    False
dtype: bool

In [48]:
(df < 0).empty()

TypeError: 'bool' object is not callable

In [49]:
df == 0

                         A      B      C
2000-01-01 00:00:00  False  False  False
2000-01-02 00:00:00  False  False  False
2000-01-03 00:00:00  False  False  False
2000-01-04 00:00:00  False  False  False
2000-01-05 00:00:00  False  False  False
2000-01-06 00:00:00  False  False  False
2000-01-07 00:00:00  False  False  False
2000-01-08 00:00:00  False  False  False
A                    False  False  False

In [50]:
(df<0).all(axis=0)

A    False
B    False
C    False
dtype: bool

In [52]:
(df>0).any(axis=0)

A    True
B    True
C    True
dtype: bool

In [53]:
df.empty

False

In [56]:
np.nan == np.nan

False

In [57]:
(df * 2) == (df + df)

                         A     B      C
2000-01-01 00:00:00   True  True   True
2000-01-02 00:00:00   True  True   True
2000-01-03 00:00:00   True  True   True
2000-01-04 00:00:00   True  True   True
2000-01-05 00:00:00   True  True   True
2000-01-06 00:00:00   True  True   True
2000-01-07 00:00:00   True  True   True
2000-01-08 00:00:00   True  True   True
A                    False  True  False

In [58]:
(df * 2).equals(df + df)

True

In [61]:
df.iloc[0].sort_index()

A   -1.106194
B   -1.110173
C   -2.079304
Name: 2000-01-01 00:00:00, dtype: float64

In [62]:
df.reset_index()

                 index         A          B         C
0  2000-01-01 00:00:00 -1.106194  -1.110173 -2.079304
1  2000-01-02 00:00:00  0.450115   0.239930  0.763129
2  2000-01-03 00:00:00  0.613700  -0.226974 -0.466956
3  2000-01-04 00:00:00  0.309631  -0.467390 -0.876184
4  2000-01-05 00:00:00  1.383765   0.767526 -0.494084
5  2000-01-06 00:00:00 -1.926546  -0.513146  2.493088
6  2000-01-07 00:00:00  0.358822   0.986121  0.858388
7  2000-01-08 00:00:00 -2.214375   0.145683  0.159049
8                    A       NaN  45.000000       NaN

In [63]:
df.reset_index().reset_index()

   level_0                index         A          B         C
0        0  2000-01-01 00:00:00 -1.106194  -1.110173 -2.079304
1        1  2000-01-02 00:00:00  0.450115   0.239930  0.763129
2        2  2000-01-03 00:00:00  0.613700  -0.226974 -0.466956
3        3  2000-01-04 00:00:00  0.309631  -0.467390 -0.876184
4        4  2000-01-05 00:00:00  1.383765   0.767526 -0.494084
5        5  2000-01-06 00:00:00 -1.926546  -0.513146  2.493088
6        6  2000-01-07 00:00:00  0.358822   0.986121  0.858388
7        7  2000-01-08 00:00:00 -2.214375   0.145683  0.159049
8        8                    A       NaN  45.000000       NaN

In [64]:
pd.Series(['A','s','D','d', 'a', 'A']) == 'A'

0     True
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [65]:
pd.Index(['a','b','a']) == 'a'

array([ True, False,  True])

In [66]:
df.combine_first(df)

                            A          B         C
2000-01-01 00:00:00 -1.106194  -1.110173 -2.079304
2000-01-02 00:00:00  0.450115   0.239930  0.763129
2000-01-03 00:00:00  0.613700  -0.226974 -0.466956
2000-01-04 00:00:00  0.309631  -0.467390 -0.876184
2000-01-05 00:00:00  1.383765   0.767526 -0.494084
2000-01-06 00:00:00 -1.926546  -0.513146  2.493088
2000-01-07 00:00:00  0.358822   0.986121  0.858388
2000-01-08 00:00:00 -2.214375   0.145683  0.159049
A                         NaN  45.000000       NaN

In [67]:
# Combine
"""
if the first hasn't the data and the second one has, put the one from the second one and
if the second hasn't and first has, put the first
IF the first has and the second has PUT the second
"""
''

''

In [74]:
df1 = pd.DataFrame([1,2,3,4])
df2 = pd.DataFrame([1,None,3,1, 9])

In [75]:
df1.combine_first(df2)

     0
0  1.0
1  2.0
2  3.0
3  4.0
4  9.0

In [76]:
df1.combine(df2, lambda x,y: y)

     0
0  1.0
1  NaN
2  3.0
3  1.0
4  9.0

In [77]:
df1.combine(df2, lambda x,y: x)

     0
0  1.0
1  2.0
2  3.0
3  4.0
4  NaN

In [78]:
df1.combine(df2, lambda x,y: x+y)

     0
0  2.0
1  NaN
2  6.0
3  5.0
4  NaN

In [80]:
df1.combine(df2, lambda x,y: x==y)

       0
0   True
1  False
2   True
3  False
4  False

In [84]:
df1.combine(df2, lambda x,y: np.where(pd.isna(x), y, x) )

     0
0  1.0
1  2.0
2  3.0
3  4.0
4  9.0

In [87]:
np.where([0,10,10,0,1,0,10,1], True, False)

array([False,  True,  True, False,  True, False,  True,  True])

In [86]:
pd.isna

In [90]:
np.where([False, True,0,10,1], 'in case of True', 'in case of False')

array(['in case of False', 'in case of True', 'in case of False',
       'in case of True', 'in case of True'], dtype='<U16')